Mrunmoy/HelixDrift/zephyr_apps/nrf52840-mocap-bridge/src/main.cpp
static void status_set_error(int err)
{
	g_helixMocapStatus.last_error = (uint32_t)(err < 0 ? -err : err);
}

static int clocks_start(void)
{
	int err;
	int res;
	struct onoff_manager *clk_mgr;
	struct onoff_client clk_cli;

	clk_mgr = z_nrf_clock_control_get_onoff(CLOCK_CONTROL_NRF_SUBSYS_HF);
	if (clk_mgr == NULL) {
		return -ENXIO;
	}

	sys_notify_init_spinwait(&clk_cli.notify);
	err = onoff_request(clk_mgr, &clk_cli);
	if (err < 0) {
		return err;
	}

	do {
		err = sys_notify_fetch_result(&clk_cli.notify, &res);
		if (!err && res) {
			return res;
		}
	} while (err);

	return 0;
}

static void led_set(bool on)
{
	if (!gpio_is_ready_dt(&led)) {
		return;
	}

	(void)gpio_pin_set_dt(&led, on ? 1 : 0);
}

static void heartbeat_tick(void)
{
	static bool on;

#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE) && defined(CONFIG_HELIX_MOCAP_NODE_LED_DEBUG)
	uint32_t period_ms = 125U;

	if (have_anchor) {
		period_ms = 500U;
	} else if (g_helixMocapStatus.tx_success > 0U) {
		period_ms = 250U;
	}

	led_set(((now_us() / 1000U) / period_ms) & 1U);
#else
	on = !on;
	led_set(on);
#endif
	g_helixMocapStatus.heartbeat++;
}

static void host_write(const char *line)
{
	if (!device_is_ready(host_stream)) {
		return;
	}

	for (const char *p = line; *p != '\0'; ++p) {
		uart_poll_out(host_stream, (unsigned char)*p);
	}
}

static void report_summary(void)
{
	char line[192];

#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_CENTRAL)
	snprintk(line,
		 sizeof(line),
		 "SUMMARY role=central rx=%u anchors=%u tracked=%u usb_lines=%u err=%u hb=%u trigs=%u\n",
		 g_helixMocapStatus.rx_packets,
		 g_helixMocapStatus.anchors_sent,
		 g_helixMocapStatus.tracked_nodes,
		 g_helixMocapStatus.usb_lines,
		 g_helixMocapStatus.last_error,
		 g_helixMocapStatus.heartbeat,
		 ota_triggers_sent);
#else
	snprintk(line,
		 sizeof(line),
		 "SUMMARY role=node id=%u tx_ok=%u tx_fail=%u anchors=%u offset_us=%d err=%u hb=%u\n",
		 g_node_id,
		 g_helixMocapStatus.tx_success,
		 g_helixMocapStatus.tx_failed,
		 g_helixMocapStatus.anchors_received,
		 g_helixMocapStatus.estimated_offset_us,
		 g_helixMocapStatus.last_error,
		 g_helixMocapStatus.heartbeat);
#endif

	host_write(line);
}

#if defined(CONFIG_USB_DEVICE_STACK) || defined(CONFIG_USB_DEVICE_STACK_NEXT)
static int host_stream_init(void)
{
	if (!device_is_ready(host_stream)) {
		return -ENODEV;
	}

	return helix_usbd_enable(host_stream, CONFIG_HELIX_MOCAP_USB_WAIT_FOR_DTR_MS);
}
#else
static int host_stream_init(void)
{
	return device_is_ready(host_stream) ? 0 : -ENODEV;
}
#endif

#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_CENTRAL)
static struct NodeTrack *find_or_add_track(uint8_t node_id)
{
	struct NodeTrack *free_slot = NULL;

	for (size_t i = 0; i < ARRAY_SIZE(tracked_nodes); ++i) {
		if (tracked_nodes[i].active && tracked_nodes[i].node_id == node_id) {
			return &tracked_nodes[i];
		}
		if (!tracked_nodes[i].active && free_slot == NULL) {
			free_slot = &tracked_nodes[i];
		}
	}

	if (free_slot == NULL) {
		return NULL;
	}

	free_slot->active = true;
	free_slot->node_id = node_id;
	g_helixMocapStatus.tracked_nodes++;
	return free_slot;
}

static void host_emit_frame(const struct HelixMocapFrame *frame, uint32_t rx_timestamp_us,
			    uint32_t gaps)
{
	char line[224];

	snprintk(line,
		 sizeof(line),
		 "FRAME node=%u seq=%u node_us=%u sync_us=%u rx_us=%u yaw_cd=%d pitch_cd=%d roll_cd=%d x_mm=%d y_mm=%d z_mm=%d gaps=%u\n",
		 frame->node_id,
		 frame->sequence,
		 frame->node_local_timestamp_us,
		 frame->node_synced_timestamp_us,
		 rx_timestamp_us,
		 frame->yaw_cdeg,
		 frame->pitch_cdeg,
		 frame->roll_cdeg,
		 frame->x_mm,
		 frame->y_mm,
		 frame->z_mm,
		 gaps);
	host_write(line);
	g_helixMocapStatus.usb_lines++;
}

static void central_handle_frame(const struct esb_payload *payload)
{
	const struct HelixMocapFrame *frame = (const struct HelixMocapFrame *)payload->data;
	struct NodeTrack *track;
	uint32_t rx_timestamp_us = now_us();
	uint32_t gaps = 0U;

	if (payload->length < sizeof(*frame) ||
	    frame->type != HELIX_PACKET_MOCAP_FRAME ||
	    frame->session_tag != (uint8_t)CONFIG_HELIX_MOCAP_SESSION_TAG) {
		return;
	}

	track = find_or_add_track(frame->node_id);
	if (track == NULL) {
		return;
	}

	if (track->packets > 0U) {
		const uint8_t expected = (uint8_t)(track->last_sequence + 1U);
		if (frame->sequence != expected) {
			gaps = (uint8_t)(frame->sequence - expected);
			track->gaps += gaps;
		}
	}

	track->packets++;
	track->last_sequence = frame->sequence;
	track->last_node_timestamp_us = frame->node_local_timestamp_us;
	track->last_synced_timestamp_us = frame->node_synced_timestamp_us;
	track->last_rx_timestamp_us = rx_timestamp_us;

	g_helixMocapStatus.last_node_id = frame->node_id;
	g_helixMocapStatus.last_sequence = frame->sequence;

	host_emit_frame(frame, rx_timestamp_us, gaps);

	struct esb_payload ack = {
		.pipe = payload->pipe,
	};

	/* Build anchor. When an OTA trigger is active, FLOOD every ACK
	 * payload with OTA_REQ + target node_id (not just ACKs going to the
	 * target). Previously we only tagged the ACK for the target Tag —
	 * but with N Tags sharing pipe 0 and heavy collisions, the target's
	 * ACK-carrying frames were the least likely to land, so triggers
	 * dropped ~50% first try (Copilot analysis, Apr 2026). Flooding
	 * every ACK means every Tag that does TX will see OTA_REQ in its
	 * next returned anchor and filter by target_node_id in firmware.
	 *
	 * retries now counts TOTAL flooded anchors sent (not per-target
	 * hits) — gives a time-bounded flood window regardless of which
	 * Tag happens to be RX'd. */
	const bool flooding = (ota_trigger_target_node != 0u);

	struct HelixSyncAnchor anchor = {
		.type = HELIX_PACKET_SYNC_ANCHOR,
		.central_id = (uint8_t)CONFIG_HELIX_MOCAP_CENTRAL_ID,
		.anchor_sequence = next_anchor_sequence++,
		.session_tag = (uint8_t)CONFIG_HELIX_MOCAP_SESSION_TAG,
		.central_timestamp_us = rx_timestamp_us,
		.flags = static_cast<uint8_t>(flooding ? HELIX_ANCHOR_FLAG_OTA_REQ : 0),
		.ota_target_node_id = flooding ? ota_trigger_target_node : (uint8_t)0,
	};
	ack.length = sizeof(anchor);
	memcpy(ack.data, &anchor, sizeof(anchor));
	if (esb_write_payload(&ack) == 0) {
		g_helixMocapStatus.anchors_sent++;
		if (flooding) {
			ota_triggers_sent++;
			if (ota_trigger_retries > 0u) {
				ota_trigger_retries--;
			} else {
				ota_trigger_target_node = 0u; /* flood window done */
			}
		}
	}
}
#endif

