Mrunmoy/HelixDrift/zephyr_apps/nrf52840-mocap-bridge/src/main.cpp
#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE)
static int16_t synth_wave(uint8_t sequence, int32_t mul, int32_t span)
{
	int32_t phase = ((int32_t)sequence * mul) % (span * 2);

	if (phase > span) {
		phase = (span * 2) - phase;
	}

	return (int16_t)(phase - (span / 2));
}

static void node_fill_frame(struct HelixMocapFrame *frame)
{
	const uint8_t sequence = (uint8_t)(g_helixMocapStatus.tx_attempts & 0xFF);
	const uint32_t local_us = now_us();
	const uint32_t synced_us = local_us - (uint32_t)estimated_offset_us;

	frame->type = HELIX_PACKET_MOCAP_FRAME;
	frame->node_id = g_node_id;
	frame->sequence = sequence;
	frame->session_tag = (uint8_t)CONFIG_HELIX_MOCAP_SESSION_TAG;
	frame->node_local_timestamp_us = local_us;
	frame->node_synced_timestamp_us = synced_us;
	frame->yaw_cdeg = synth_wave(sequence, 37, 3600);
	frame->pitch_cdeg = synth_wave(sequence, 23, 1800);
	frame->roll_cdeg = synth_wave(sequence, 17, 1800);
	frame->x_mm = synth_wave(sequence, 11, 1200);
	frame->y_mm = synth_wave(sequence, 13, 1200);
	frame->z_mm = synth_wave(sequence, 19, 1200);
}

static void node_handle_anchor(const struct esb_payload *payload)
{
	if (payload->length < 1) {
		return;
	}

	/* Check for OTA trigger packet. This runs in ESB ISR context —
	 * just set the flag; the main loop does the actual reboot. */
	if (payload->data[0] == HELIX_PACKET_OTA_TRIGGER &&
	    payload->length >= sizeof(HelixOtaTrigger)) {
		const struct HelixOtaTrigger *trig =
			(const struct HelixOtaTrigger *)payload->data;
		if (trig->session_tag == (uint8_t)CONFIG_HELIX_MOCAP_SESSION_TAG &&
		    trig->magic == kOtaTriggerMagic &&
		    (trig->target_node_id == 0xFFu ||
		     trig->target_node_id == g_node_id)) {
			atomic_set(&ota_reboot_pending, 1);
		}
		return;
	}

	const struct HelixSyncAnchor *anchor = (const struct HelixSyncAnchor *)payload->data;
	const uint32_t local_us = now_us();

	/* Accept both 8-byte (legacy, no flags) and 9-byte (flags) anchors.
	 * sizeof(HelixSyncAnchor) is 9 in v2+, we check the legacy 8. */
	constexpr size_t kLegacyAnchorSize = 8u;
	if (payload->length < kLegacyAnchorSize ||
	    anchor->type != HELIX_PACKET_SYNC_ANCHOR ||
	    anchor->session_tag != (uint8_t)CONFIG_HELIX_MOCAP_SESSION_TAG) {
		return;
	}

	/* Handle OTA trigger (piggybacked on anchor flags).
	 *  - 9-byte anchor (legacy): flag set → reboot (single-target semantics
	 *    because old Hubs only tagged the target's ACK).
	 *  - 10-byte anchor (v3+): Hub floods the flag on *every* ACK, so we
	 *    must filter by the ota_target_node_id field. 0xFF = broadcast
	 *    (reboot all). Own node_id (runtime, flash-provisioned) = targeted
	 *    reboot. Any other value = not for us, ignore. */
	if (!(anchor->flags & HELIX_ANCHOR_FLAG_OTA_REQ)) {
		/* no trigger bit — fast path */
	} else if (payload->length >= sizeof(*anchor)) {
		/* v3+ anchor — filter by target */
		if (anchor->ota_target_node_id == g_node_id ||
		    anchor->ota_target_node_id == 0xFFu) {
			atomic_set(&ota_reboot_pending, 1);
		}
	} else if (payload->length >= 9) {
		/* legacy 9-byte anchor — no target field, legacy semantics */
		atomic_set(&ota_reboot_pending, 1);
	}

	estimated_offset_us = (int32_t)(local_us - anchor->central_timestamp_us);
	g_helixMocapStatus.estimated_offset_us = estimated_offset_us;
	g_helixMocapStatus.anchors_received++;
	have_anchor = true;
}
#endif

static void event_handler(struct esb_evt const *event)
{
	switch (event->evt_id) {
	case ESB_EVENT_TX_SUCCESS:
		g_helixMocapStatus.tx_success++;
#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE)
		atomic_set(&tx_ready, 1);
#endif
		break;
	case ESB_EVENT_TX_FAILED:
		g_helixMocapStatus.tx_failed++;
		(void)esb_flush_tx();
#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE)
		atomic_set(&tx_ready, 1);
#endif
		break;
	case ESB_EVENT_RX_RECEIVED:
		while (esb_read_rx_payload(&rx_payload) == 0) {
			g_helixMocapStatus.rx_packets++;
			g_helixMocapStatus.last_rx_len = rx_payload.length;
#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_CENTRAL)
			central_handle_frame(&rx_payload);
#else
			node_handle_anchor(&rx_payload);
#endif
		}
		break;
	default:
		break;
	}
}

static int esb_initialize(void)
{
	int err;
	uint8_t base_addr_0[4] = {0xD3, 0xC1, 0xB2, 0xA1};
	uint8_t base_addr_1[4] = {0x44, 0x33, 0x22, 0x11};
	uint8_t addr_prefix[8] = {0xE7, 0xC2, 0xC3, 0xC4, 0xC5, 0xC6, 0xC7, 0xC8};
	struct esb_config config = ESB_DEFAULT_CONFIG;

	config.protocol = ESB_PROTOCOL_ESB_DPL;
	config.bitrate = ESB_BITRATE_2MBPS;
	config.event_handler = event_handler;
	config.retransmit_delay = 600;
	config.retransmit_count = 6;
	config.selective_auto_ack = true;
	config.payload_length = 32;
	config.mode =
#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_CENTRAL)
		ESB_MODE_PRX;
#else
		ESB_MODE_PTX;
#endif

	err = esb_init(&config);
	if (err) {
		return err;
	}

	err = esb_set_base_address_0(base_addr_0);
	if (err) {
		return err;
	}

	err = esb_set_base_address_1(base_addr_1);
	if (err) {
		return err;
	}

	err = esb_set_prefixes(addr_prefix, ARRAY_SIZE(addr_prefix));
	if (err) {
		return err;
	}

	err = esb_set_rf_channel(CONFIG_HELIX_MOCAP_RF_CHANNEL);
	if (err) {
		return err;
	}

	(void)esb_flush_tx();
	(void)esb_flush_rx();
	return 0;
}

#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE)
static void maybe_send_frame(void)
{
	struct HelixMocapFrame frame;
	int err;

	if (!atomic_cas(&tx_ready, 1, 0)) {
		return;
	}

	node_fill_frame(&frame);
	tx_payload.pipe = CONFIG_HELIX_MOCAP_PIPE;
	tx_payload.noack = 0;
	tx_payload.length = sizeof(frame);
	memcpy(tx_payload.data, &frame, sizeof(frame));

	g_helixMocapStatus.last_sequence = frame.sequence;
	g_helixMocapStatus.last_node_id = frame.node_id;
	g_helixMocapStatus.tx_attempts++;

	err = esb_write_payload(&tx_payload);
	if (err) {
		status_set_error(err);
		atomic_set(&tx_ready, 1);
	}
}
#endif

/* ── BLE OTA Boot Window (node role only) ──────────────────────── */
#if defined(CONFIG_BT) && defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE) && \
    (CONFIG_HELIX_OTA_BOOT_WINDOW_MS > 0)

#define BT_UUID_HELIX_OTA_SERVICE_VAL \
    BT_UUID_128_ENCODE(0x3ef6a001, 0x2d3b, 0x4f2a, 0x89e4, 0x7b59d1c0a001)
#define BT_UUID_HELIX_OTA_CTRL_VAL \
    BT_UUID_128_ENCODE(0x3ef6a002, 0x2d3b, 0x4f2a, 0x89e4, 0x7b59d1c0a001)
#define BT_UUID_HELIX_OTA_DATA_VAL \
    BT_UUID_128_ENCODE(0x3ef6a003, 0x2d3b, 0x4f2a, 0x89e4, 0x7b59d1c0a001)
#define BT_UUID_HELIX_OTA_STATUS_VAL \
    BT_UUID_128_ENCODE(0x3ef6a004, 0x2d3b, 0x4f2a, 0x89e4, 0x7b59d1c0a001)

static struct bt_uuid_128 ota_svc_uuid = BT_UUID_INIT_128(BT_UUID_HELIX_OTA_SERVICE_VAL);
static struct bt_uuid_128 ota_ctrl_uuid = BT_UUID_INIT_128(BT_UUID_HELIX_OTA_CTRL_VAL);
static struct bt_uuid_128 ota_data_uuid = BT_UUID_INIT_128(BT_UUID_HELIX_OTA_DATA_VAL);
static struct bt_uuid_128 ota_status_uuid = BT_UUID_INIT_128(BT_UUID_HELIX_OTA_STATUS_VAL);

static helix::ZephyrOtaFlashBackend ota_backend;
static helix::OtaManager ota_manager{ota_backend};
static helix::OtaManagerAdapter ota_adapter{ota_manager};
static helix::BleOtaService ota_service{ota_adapter, CONFIG_HELIX_OTA_TARGET_ID};

