Mrunmoy/HelixDrift/zephyr_apps/nrf52840-mocap-bridge/src/main.cpp
static struct bt_conn *ota_conn;
static bool ota_connected;

static volatile bool ota_commit_pending;

/* Deferred BEGIN: flash erase takes ~10s and would block the BLE stack
 * if run inside the GATT callback, causing supervision timeout. Instead,
 * we save the BEGIN parameters and process them in the main OTA loop. */
static volatile bool ota_begin_pending;
static uint8_t ota_begin_buf[16];
static uint16_t ota_begin_len;

static ssize_t ota_write_ctrl(struct bt_conn *, const struct bt_gatt_attr *,
                              const void *buf, uint16_t len, uint16_t, uint8_t)
{
	const auto *data = static_cast<const uint8_t *>(buf);

	/* Defer BEGIN (cmd=0x01) to the main loop — flash erase is too slow
	 * to run inside the GATT callback. But validate payload *here* so we
	 * can NACK immediately on bad target_id or short payload; otherwise
	 * the uploader would think BEGIN succeeded and poll STATUS forever
	 * while the main-loop handleControlWrite silently rejects. */
	if (len > 0 && data[0] == helix::BleOtaService::CMD_BEGIN) {
		if (len < helix::BleOtaService::kCtrlBeginMinLen ||
		    len > sizeof(ota_begin_buf)) {
			return BT_GATT_ERR(BT_ATT_ERR_VALUE_NOT_ALLOWED);
		}
		/* Validate target_id before accepting. Layout: [cmd][size:4][crc:4][tid:4] */
		uint32_t req_tid = (uint32_t)data[9]
		                 | ((uint32_t)data[10] << 8)
		                 | ((uint32_t)data[11] << 16)
		                 | ((uint32_t)data[12] << 24);
		if (req_tid != (uint32_t)CONFIG_HELIX_OTA_TARGET_ID) {
			return BT_GATT_ERR(BT_ATT_ERR_VALUE_NOT_ALLOWED);
		}
		memcpy(ota_begin_buf, data, len);
		ota_begin_len = len;
		ota_begin_pending = true;
		return static_cast<ssize_t>(len); /* ACK, main loop does erase */
	}

	auto status = ota_service.handleControlWrite(data, len);
	if (status == helix::OtaStatus::OK &&
	    ota_manager.state() == helix::OtaState::COMMITTED) {
		ota_commit_pending = true;
	}
	return status == helix::OtaStatus::OK
	       ? static_cast<ssize_t>(len)
	       : BT_GATT_ERR(BT_ATT_ERR_VALUE_NOT_ALLOWED);
}

static ssize_t ota_write_data(struct bt_conn *, const struct bt_gatt_attr *,
                              const void *buf, uint16_t len, uint16_t, uint8_t)
{
	auto status = ota_service.handleDataWrite(static_cast<const uint8_t *>(buf), len);
	return status == helix::OtaStatus::OK
	       ? static_cast<ssize_t>(len)
	       : BT_GATT_ERR(BT_ATT_ERR_VALUE_NOT_ALLOWED);
}

static ssize_t ota_read_status(struct bt_conn *, const struct bt_gatt_attr *attr,
                               void *buf, uint16_t len, uint16_t offset)
{
	uint8_t status[helix::BleOtaService::kStatusLen] = {};
	size_t slen = 0;
	ota_service.getStatus(status, &slen);
	return bt_gatt_attr_read(nullptr, attr, buf, len, offset, status, slen);
}

BT_GATT_SERVICE_DEFINE(helix_ota_svc,
    BT_GATT_PRIMARY_SERVICE(&ota_svc_uuid),
    BT_GATT_CHARACTERISTIC(&ota_ctrl_uuid.uuid,
                           BT_GATT_CHRC_WRITE,
                           BT_GATT_PERM_WRITE,
                           nullptr, ota_write_ctrl, nullptr),
    BT_GATT_CHARACTERISTIC(&ota_data_uuid.uuid,
                           BT_GATT_CHRC_WRITE | BT_GATT_CHRC_WRITE_WITHOUT_RESP,
                           BT_GATT_PERM_WRITE,
                           nullptr, ota_write_data, nullptr),
    BT_GATT_CHARACTERISTIC(&ota_status_uuid.uuid,
                           BT_GATT_CHRC_READ,
                           BT_GATT_PERM_READ,
                           ota_read_status, nullptr, nullptr),
);

static void ota_bt_connected(struct bt_conn *conn, uint8_t err)
{
	if (err == 0 && !ota_conn) {
		ota_conn = bt_conn_ref(conn);
		ota_connected = true;
		printk("ota: connected\n");
	}
}

static void ota_bt_disconnected(struct bt_conn *conn, uint8_t reason)
{
	if (ota_conn == conn) {
		bt_conn_unref(ota_conn);
		ota_conn = nullptr;
		ota_connected = false;
		printk("ota: disconnected reason=%u\n", reason);
	}
}

BT_CONN_CB_DEFINE(ota_conn_cbs) = {
    .connected = ota_bt_connected,
    .disconnected = ota_bt_disconnected,
};

/* Run the BLE OTA boot window. Returns true if OTA completed (reboot
 * happens inside), false if the window expired with no connection. */
static bool run_ota_boot_window(void)
{
	printk("ota: boot window %d ms\n", CONFIG_HELIX_OTA_BOOT_WINDOW_MS);
	g_helixMocapStatus.last_error = 0xBB01U; /* entered OTA window */

	if (boot_write_img_confirmed() == 0) {
		printk("mcuboot: image confirmed\n");
	}
	g_helixMocapStatus.last_error = 0xBB02U; /* img confirmed */


	if (!ota_backend.init()) {
		printk("ota: backend init failed\n");
		g_helixMocapStatus.last_error = 0xBBFEU;
		return false;
	}
	g_helixMocapStatus.last_error = 0xBB03U; /* backend init ok */

	/* Pre-bt_enable settle delay. On fast back-to-back reboots (OTA +
	 * warm-ish NVIC reset), the SoftDevice Controller's LF clock /
	 * MPSL calibration hasn't re-converged, and the first connection
	 * after bt_enable() drops with supervision-timeout (reason=8)
	 * within ~3 s — consistent with LFRC drift accumulating to a full
	 * connection-interval miss. 2 s fixed 4/5 cycles; cycle 5 failed
	 * the same way deterministically (including an automatic retry),
	 * suggesting the die has warmed across prior OTAs and LFRC has
	 * drifted further from the cold-boot calibration point. 4 s gives
	 * MPSL enough time to re-converge even on a warm chip. */
	k_sleep(K_MSEC(4000));

	int err = bt_enable(nullptr);
	if (err) {
		printk("ota: bt_enable failed %d\n", err);
		g_helixMocapStatus.last_error = 0xBB00U | (uint32_t)(unsigned)(-err);
		return false;
	}
	g_helixMocapStatus.last_error = 0xBB04U; /* bt_enable ok */

	/* Build unique name from FICR */
	{
		const auto ficr0 = *reinterpret_cast<const volatile uint32_t *>(0x100000A4U);
		static const char hex[] = "0123456789ABCDEF";
		char name[16];
		const char *base = CONFIG_BT_DEVICE_NAME;
		size_t n = strlen(base);
		memcpy(name, base, n);
		name[n]     = '-';
		name[n + 1] = hex[(ficr0 >>  4) & 0xF];
		name[n + 2] = hex[ ficr0        & 0xF];
		name[n + 3] = hex[(ficr0 >> 12) & 0xF];
		name[n + 4] = hex[(ficr0 >>  8) & 0xF];
		name[n + 5] = '\0';
		bt_set_name(name);
		printk("ota: name %s\n", name);
	}

	/* Read our own MCUboot image version from the active slot */
	struct mcuboot_img_header img_hdr = {};
	uint8_t app_major = 0, app_minor = 0;
	uint16_t app_rev = 0;
	uint32_t app_build = 0;
	if (boot_read_bank_header(FIXED_PARTITION_ID(slot0_partition),
	                          &img_hdr, sizeof(img_hdr)) == 0 &&
	    img_hdr.mcuboot_version == 1) {
		app_major = img_hdr.h.v1.sem_ver.major;
		app_minor = img_hdr.h.v1.sem_ver.minor;
		app_rev = img_hdr.h.v1.sem_ver.revision;
		app_build = img_hdr.h.v1.sem_ver.build_num;
	}
	printk("ota: app v%u.%u.%u+%u\n", app_major, app_minor, app_rev, app_build);

