Mrunmoy/HelixDrift/zephyr_apps/nrf52840-mocap-bridge/src/main.cpp
	/* Build advertising data — use static storage so pointers persist */
	const char *bt_name = bt_get_name();
	static uint8_t adv_flags[] = {BT_LE_AD_GENERAL | BT_LE_AD_NO_BREDR};

	/* Manufacturer-specific data carrying versions.
	 * Layout: [company_id_lo][company_id_hi] [tag='H'][payload_ver=1]
	 *         [app_major][app_minor][app_rev_lo][app_rev_hi]
	 *         [boot_major][boot_minor][boot_rev_lo][boot_rev_hi]
	 * Total: 12 bytes payload (build_num dropped for BLE fit).
	 * Adv budget: flags(3) + name "HTag-XXXX"(11) + mfg(14) = 28 / 31 bytes. */
	static uint8_t mfg_data[12];
	mfg_data[0] = 0xFF; mfg_data[1] = 0xFF;  /* local-use company id */
	mfg_data[2] = 'V';                        /* v4 marker byte changed H->V to prove swap */
	mfg_data[3] = 0x01;                       /* payload version */
	mfg_data[4] = app_major;
	mfg_data[5] = app_minor;
	mfg_data[6] = app_rev & 0xFF;
	mfg_data[7] = (app_rev >> 8) & 0xFF;
	mfg_data[8]  = CONFIG_HELIX_BOOTLOADER_VERSION_MAJOR;
	mfg_data[9]  = CONFIG_HELIX_BOOTLOADER_VERSION_MINOR;
	mfg_data[10] = CONFIG_HELIX_BOOTLOADER_VERSION_REVISION & 0xFF;
	mfg_data[11] = (CONFIG_HELIX_BOOTLOADER_VERSION_REVISION >> 8) & 0xFF;

	static struct bt_data ad[3];
	ad[0] = {BT_DATA_FLAGS, sizeof(adv_flags), adv_flags};
	ad[1] = {BT_DATA_NAME_COMPLETE, static_cast<uint8_t>(strlen(bt_name)),
	         reinterpret_cast<const uint8_t *>(bt_name)};
	ad[2] = {BT_DATA_MANUFACTURER_DATA, sizeof(mfg_data), mfg_data};

	err = bt_le_adv_start(BT_LE_ADV_CONN_FAST_1, ad, 3, nullptr, 0);
	if (err) {
		printk("ota: adv start failed %d\n", err);
		g_helixMocapStatus.last_error = 0xBBA0U | (uint32_t)(unsigned)(-err);
		bt_disable();
		return false;
	}
	g_helixMocapStatus.last_error = 0xBB05U; /* adv start ok */

	/* Wait for connection or timeout */
	int64_t deadline = k_uptime_get() + CONFIG_HELIX_OTA_BOOT_WINDOW_MS;
	while (k_uptime_get() < deadline && !ota_connected) {
		led_set(((k_uptime_get() / 100) & 1) != 0); /* fast blink = OTA window */
		k_sleep(K_MSEC(50));
	}

	if (!ota_connected) {
		printk("ota: window expired, switching to ESB\n");
		g_helixMocapStatus.last_error = 0xBB06U; /* window expired */
		bt_le_adv_stop();
		bt_disable();
		return false;
	}

	/* Connected — run OTA until complete or disconnect.
	 * Commit is deferred from the GATT callback to avoid flash writes
	 * interfering with BLE timing. The ota_commit_pending flag signals
	 * that commit succeeded and we should reboot. */
	printk("ota: running OTA transfer\n");
	uint32_t last_bytes = 0;
	uint32_t stall_ticks = 0;
	while (ota_connected) {
		/* Deferred BEGIN: run flash erase in the main loop where it
		 * won't block the BLE stack's connection event processing. */
		if (ota_begin_pending) {
			printk("ota: begin (deferred erase)\n");
			auto status = ota_service.handleControlWrite(ota_begin_buf, ota_begin_len);
			printk("ota: begin status=%d\n", static_cast<int>(status));
			ota_begin_pending = false;
		}
		if (ota_commit_pending) {
			printk("ota: commit done, rebooting\n");
			k_sleep(K_MSEC(CONFIG_HELIX_OTA_REBOOT_DELAY_MS));
			sys_reboot(SYS_REBOOT_COLD);
		}
		uint32_t bytes = ota_manager.bytesReceived();
		if (ota_manager.state() == helix::OtaState::RECEIVING) {
			if (bytes == last_bytes) {
				stall_ticks++;
			} else {
				stall_ticks = 0;
				last_bytes = bytes;
			}
			if (stall_ticks >= 600) { /* 600 * 50ms = 30s */
				printk("ota: stall, disconnecting\n");
				bt_conn_disconnect(ota_conn, BT_HCI_ERR_REMOTE_USER_TERM_CONN);
				break;
			}
		}
		led_set(((k_uptime_get() / 250) & 1) != 0); /* medium blink = OTA active */
		k_sleep(K_MSEC(50));
	}
	/* Check commit after disconnect too (commit might have set flag just as connection dropped) */
	if (ota_commit_pending) {
		printk("ota: commit done (post-disconnect), rebooting\n");
		k_sleep(K_MSEC(CONFIG_HELIX_OTA_REBOOT_DELAY_MS));
		sys_reboot(SYS_REBOOT_COLD);
	}

	/* If we get here without reboot, OTA was aborted or stalled */
	printk("ota: session ended without commit, switching to ESB\n");
	bt_le_adv_stop();
	bt_disable();
	return false;
}

#endif /* CONFIG_BT && ROLE_NODE && BOOT_WINDOW > 0 */

int main(void)
{
	int err;

	/* Resolve node_id from flash first so every subsequent subsystem
	 * (ESB init, logging, OTA trigger filter) sees the provisioned value. */
	g_node_id = helix_load_node_id();

	memset((void *)&g_helixMocapStatus, 0, sizeof(g_helixMocapStatus));
	g_helixMocapStatus.magic = 0x484D4244U;
	g_helixMocapStatus.role =
#if defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_CENTRAL)
		1U;
#else
		2U;
#endif
	g_helixMocapStatus.phase = 1U;

	if (gpio_is_ready_dt(&led)) {
		(void)gpio_pin_configure_dt(&led, GPIO_OUTPUT_INACTIVE);
	}

	err = clocks_start();
	if (err) {
		status_set_error(err);
	}
	g_helixMocapStatus.phase = 2U;

	err = host_stream_init();
	if (err) {
		status_set_error(err);
	}
	g_helixMocapStatus.phase = 3U;

#if defined(CONFIG_HELIX_OTA_HUB_RELAY)
	ota_hub_relay_init(host_stream);
#endif

#if defined(CONFIG_BOARD_PROMICRO_NRF52840_NRF52840)
	/* NCS v3.2.4 UARTE legacy shim PSEL.TXD workaround */
	{
		volatile auto *pselTxd = reinterpret_cast<volatile uint32_t *>(0x40002508U);
		if (*pselTxd == 0xFFFFFFFFU) {
			*pselTxd = 9U;
		}
	}
#endif

	/* ── BLE OTA boot window (node only) ────────────────── */
#if defined(CONFIG_BT) && defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE) && \
    (CONFIG_HELIX_OTA_BOOT_WINDOW_MS > 0)
	run_ota_boot_window();
	/* If we return here, OTA either wasn't requested or was aborted.
	 * bt_disable() was called. Proceed to ESB. */
#endif

	/* ── Release BLE/MPSL before ESB ──────────────────── */
#if defined(CONFIG_BT)
	/* Both Hub and Tag need bt_enable()+bt_disable() before esb_init()
	 * to properly cycle MPSL resources. The SoftDevice Controller's
	 * SYS_INIT claims TIMER0/RTC0/RADIO. bt_disable() with
	 * CONFIG_BT_UNINIT_MPSL_ON_DISABLE releases them for ESB. */
#if !defined(CONFIG_HELIX_MOCAP_BRIDGE_ROLE_NODE) || \
    !(CONFIG_HELIX_OTA_BOOT_WINDOW_MS > 0)
	{
		int bt_err = bt_enable(nullptr);
		if (bt_err == 0 || bt_err == -EALREADY) {
			bt_disable();
			printk("ble/mpsl released for esb\n");
		}
	}
#endif
#endif

